{
  "about": {
    "title": "Read News App",
    "description1": "Aplicación móvil para explorar titulares recientes, seguir artículos y leerlos con una interfaz limpia, rápida y sin distracciones.",
    "description2": "Usa la API pública de The Guardian para búsqueda en tiempo real, carga bajo demanda y navegación con tabs optimizada para iOS y Android.",
    "authorTitle": "Autor y objetivo",
    "authorBody": "Proyecto desarrollado por Ramses Gonzalez para Conexa como muestra de arquitectura con React Native + Expo, manejo de estado con hooks y patrones reutilizables orientados a productos editoriales.",
    "toolsTitle": "Herramientas y stack",
    "toolsBody": "Se construyó con Expo Router para las rutas de tabs/stacks, React Query para consumir noticias y usuarios, Zustand + AsyncStorage para la sesión, validaciones con Yup y pruebas con Jest + Testing Library.",
    "badges": {
      "expo": "Expo",
      "router": "Expo Router",
      "reactNative": "React Native",
      "hooks": "Hooks",
      "api": "Guardian API",
      "animations": "Animaciones",
      "reactQuery": "React Query",
      "zustand": "Zustand",
      "tests": "Jest + RTL"
    },
    "featuresTitle": "Lo que incluye este challenge",
    "featuresDescription": "Resumen de las piezas relevantes agregadas para la evaluación técnica:",
    "features": [
      "Flujo de autenticación con formularios validados, estado global en Zustand y persistencia con AsyncStorage.",
      "Tabs diferenciadas: Home/About públicas, Login solo sin sesión y Bookmarks/Users/Profile solo para usuarios logueados.",
      "Pantalla Home probada con Jest + Testing Library, mockeando hooks y validando interacciones reales del TextInput.",
      "Listado de noticias y usuarios alimentado por React Query y servicios configurados mediante alias en Babel/js.config.",
      "UI reutilizable (InputSearch, AnimatedIconButton, Skeletons, etc.) con theming centralizado y animaciones simples."
    ]
  },
  "tabs": {
    "saved": "Guardados",
    "bookmarks": "Favoritos",
    "home": "Inicio",
    "about": "Acerca de",
    "login": "Registro",
    "users": "Usuarios",
    "user": "Perfil"
  }
}
